controllers/CategoryController.php

    public function actionIndex(){

        $hits = Product::find()->where(['hit' => '1'])->limit(6)->all();
---
SELECT * FROM `product` WHERE `hit`='1' LIMIT 6

    public function actionView($id){

//        $id = Yii::$app->request->get('id');
//        $products = Product::find()->where(['category_id' => $id])->all();

        $category = Category::findOne($id);

        if (empty($category))
            throw new HttpException('404', 'Данной категории товаров нет');

        $query = Product::find()->where(['category_id' => $id]);
        $pages = new Pagination(['totalCount' => $query->count(), 'pageSize' => 3, 'forcePageParam' => false, 'pageSizeParam' => false]);
        $products = $query->offset($pages->offset)->limit($pages->limit)->all();
---
SELECT * FROM `category` WHERE `id`='29'
SELECT * FROM `product` WHERE `category_id`='24' LIMIT 3
SELECT COUNT(*) FROM `product` WHERE `category_id`='29'
SELECT * FROM `product` WHERE `category_id`='29' LIMIT 3

    public function actionSearch(){
        $q = trim(Yii::$app->request->get('q'));

        $this->setMeta('E-SHOPPER | Search: '.$q, $category->keywords, $category->description);

        if (!$q)
            return $this->render('search');
        $query = Product::find()->where(['like', 'name', $q]);
        $pages = new Pagination(['totalCount' => $query->count(), 'pageSize' => 3, 'forcePageParam' => false, 'pageSizeParam' => false]);
        $products = $query->offset($pages->offset)->limit($pages->limit)->all();
---
SELECT * FROM `product` WHERE `name` LIKE '%<script>alert(111);</script>%' LIMIT 3
SELECT COUNT(*) FROM `product` WHERE `name` LIKE '%1%'
SELECT * FROM `product` WHERE `name` LIKE '%1%' LIMIT 3