controllers/ProductController.php

    public function actionView($id){
//        $id = Yii::$app->request->get('id');
        $product = Product::findOne($id);   //ленивая загрузка
//        $product = Product::find()->with('category')->where(['id' => $id])->one();  //жадная загрузка

        if (empty($product))
            throw new HttpException('404', 'Данного товара нет в базе');


//        $hits = Product::find()->where(['hit' => '1'])->limit(6)->all();
        $hits = Product::find()->where(['hit' => '1'])->all();
---
SELECT * FROM `product` WHERE `id`='11'
SELECT * FROM `product` WHERE `hit`='1'