components/MenuWidget.php

SELECT * FROM `category`
---
    public function run(){
        // get cache
        $menu = Yii::$app->cache->get('menu');
        if ($menu) {
            return $menu;
        }
        else {
            $this->data = Category::find()->indexBy('id')->asArray()->all();